# Taps
tap "homebrew/bundle"

# Core Utilities (CLI Tools)
brew "git"
brew "gh"         # GitHub CLI
brew "stow"       # Dotfiles manager
brew "fzf"        # Fuzzy Finder
brew "uv"         # Python manager
brew "fnm"        # Node.js manager
brew "starship"   # Prompt

# Zsh Plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks (GUI Apps)
cask "ghostty"    # Terminal
cask "orbstack"   # Docker alternative
cask "cursor"     # AI Editor
cask "visual-studio-code"
cask "raycast"
cask "rectangle"
cask "alt-tab"

# Fonts
cask "font-hack-nerd-font"

